xffxxf/myir-optee/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp2/fw/config_all.c
struct fwk_module_config config_optee_clock = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(optee_clock_get_element_table),
};
#endif

/* Config data for scmi_reset_domain, reset_domain and optee_reset modules */
#ifdef CFG_SCPFW_MOD_RESET_DOMAIN
struct fwk_module_config config_scmi_reset_domain = {
    .data = &((struct mod_scmi_reset_domain_config){
        .agent_table = NULL,			/* Allocated during initialization */
        .agent_count = 0,			/* Set during initialization */
    }),
};

static const struct fwk_element *reset_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_RESET_DOMAIN);
    return (const struct fwk_element *)reset_elt;
}

struct fwk_module_config config_reset_domain = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(reset_get_element_table),
};

static const struct fwk_element *optee_reset_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_OPTEE_RESET);
    return (const struct fwk_element *)optee_reset_elt;
}

struct fwk_module_config config_optee_reset = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(optee_reset_get_element_table),
};
#endif

#ifdef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
/* Config data for scmi_voltage_domain, voltage_domain and optee_regu modules */
struct fwk_module_config config_scmi_voltage_domain = {
    .data = &((struct mod_scmi_voltd_config){
        .agent_table = NULL,			/* Allocated during initialization */
        .agent_count = 0,			/* Set during initialization */
    }),
};

static const struct fwk_element *voltd_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_VOLTAGE_DOMAIN);
    return (const struct fwk_element *)voltd_elt;
}

struct fwk_module_config config_voltage_domain = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(voltd_get_element_table),
};

static const struct fwk_element *optee_voltd_regulator_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_OPTEE_VOLTD_REGULATOR);
    return (const struct fwk_element *)optee_regu_elt;
}

struct fwk_module_config config_optee_voltd_regulator = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(optee_voltd_regulator_get_element_table),
};
#endif

#ifdef CFG_SCPFW_MOD_DVFS
/* Config data for scmi_perf and dvfs  module */
struct fwk_module_config config_scmi_perf = {
    .data = &((struct mod_scmi_perf_config){
        .domains = NULL,			/* Allocated during initialization */
        .perf_doms_count = 0,			/* Set during initialization */
        .fast_channels_alarm_id = FWK_ID_NONE_INIT,
#ifdef BUILD_HAS_MOD_STATISTICS
        .stats_enabled = true,
#endif
    }),
};

static const struct fwk_element *dvfs_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_DVFS);
    return (const struct fwk_element *)dvfs_elt;
}

struct fwk_module_config config_dvfs = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(dvfs_get_element_table),
};

/* Config data for psu and optee/psu module */
static const struct fwk_element *psu_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_PSU);
    return (const struct fwk_element *)psu_elt;
}

struct fwk_module_config config_psu = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(psu_get_element_table),
};

static const struct fwk_element *psu_optee_regu_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_PSU_OPTEE_REGULATOR);
    return (const struct fwk_element *)psu_optee_regu_elt ;
}

struct fwk_module_config config_psu_optee_regulator = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(psu_optee_regu_get_element_table),
};
#endif

#ifdef CFG_SCPFW_MOD_POWER_DOMAIN
/* SCMI power domain module*/
struct fwk_module_config config_scmi_power_domain = { 0 };

/* Power domain module */
enum pd_static_dev_idx {
    PD_STATIC_DEV_IDX_NONE = UINT32_MAX
};

static const uint32_t pd_allowed_state_mask_table[] = {
    [MOD_PD_STATE_OFF] = MOD_PD_STATE_OFF_MASK,
    [MOD_PD_STATE_ON] = MOD_PD_STATE_OFF_MASK | MOD_PD_STATE_ON_MASK,
};

static const struct mod_power_domain_config power_domain_config = { 0 };

static const struct fwk_element *pd_get_element_table(fwk_id_t module_id)
{
    return (const struct fwk_element *)pd_elt;
}

struct fwk_module_config config_power_domain = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(pd_get_element_table),
    .data = &power_domain_config,
};

/* STM32 power domain module */
static const struct fwk_element *stm32_pd_get_element_table(fwk_id_t module_id)
{
    fwk_assert(fwk_id_get_module_idx(module_id) == FWK_MODULE_IDX_STM32_PD);
    return (const struct fwk_element *)stm32_pd_elt;
}

struct fwk_module_config config_stm32_pd = {
    .elements = FWK_MODULE_DYNAMIC_ELEMENTS(stm32_pd_get_element_table),
};
#endif

/*
 * Indices state when applying agents configuration
 * @channel_count: Number of channels (mailbox/shmem links) used
 * @clock_index: Current index for clock and optee/clock (same indices)
 * @clock_count: Number of clocks (also number of optee/clocks)
 * @reset_index: Current index for reset controller and optee/reset
 * @reset_count: Number of reset controller (optee/reset) instances
 * @regu_index: Current index for voltd and optee/regulator
 * @regu_count: Number of voltd (optee/regulator) instances
 * @psu_index: Current index for PSU and optee/PSU instances
 * @psu_count: Number of PSU (optee/PSU) instances
 * @dvfs_index: Current index for DVFS instance
 * @dvfs_count: Number of DVFS instances
 */
struct scpfw_resource_counter {
    size_t channel_count;
    size_t clock_index;
    size_t clock_count;
    size_t reset_index;
    size_t reset_count;
    size_t regu_index;
    size_t regu_count;
    size_t psu_index;
    size_t psu_count;
    size_t dvfs_index;
    size_t dvfs_count;
    size_t pd_index;
    size_t pd_count;
} scpfw_resource_counter;

/*
 * Count once for all the several instances and allocate global resources.
 * Global resources are clock, optee/clock, reset, optee/reset, regu,
 * optee/regu, psu, optee/psu, dvfs, perfd, ...;
 */
static void count_resources(struct scpfw_config *cfg)
{
    size_t i, j;

    for (i = 0; i < cfg->agent_count; i++) {
        struct scpfw_agent_config *agent_cfg = cfg->agent_config + i;

        scpfw_resource_counter.channel_count += agent_cfg->channel_count;

