xffxxf/myir-optee/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp2/fw/config_all.c
static void set_scmi_comm_resources(struct scpfw_config *cfg)
{
    unsigned int channel_index = 0;
    unsigned int __maybe_unused msg_smt_index = 0, optee_smt_index = 0;
    size_t i, j;
    /* @cfg does not consider agent #0 this the reserved platform/server agent */
    size_t scmi_agent_count = cfg->agent_count + 1;

    scmi_agent_table = fwk_mm_calloc(scmi_agent_count,
                                     sizeof(*scmi_agent_table));

    scmi_service_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                     sizeof(*scmi_service_elt));

#ifdef CFG_SCPFW_MOD_MSG_SMT
    msg_smt_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                sizeof(*msg_smt_elt));
    msg_smt_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                 sizeof(*msg_smt_data));
#endif

#ifdef CFG_SCPFW_MOD_OPTEE_SMT
    optee_smt_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                  sizeof(*optee_smt_elt));
    optee_smt_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                   sizeof(*optee_smt_data));
#endif

    optee_mbx_elt = fwk_mm_calloc(scpfw_resource_counter.channel_count + 1,
                                  sizeof(*optee_mbx_elt));
    optee_mbx_data = fwk_mm_calloc(scpfw_resource_counter.channel_count,
                                   sizeof(*optee_mbx_data));

    /* Set now the uniqnue scmi module instance configuration data */
    scmi_data = (struct mod_scmi_config){
        .agent_table = scmi_agent_table,
        .agent_count = scmi_agent_count,
        .protocol_count_max = 9,
        .vendor_identifier = "STMicroelectronics",
        .sub_vendor_identifier = "STMicroelectronics",
    };

    for (i = 0; i < cfg->agent_count; i++) {
        struct scpfw_agent_config *agent_cfg = cfg->agent_config + i;
        size_t agent_index = agent_cfg->agent_id;

        scmi_agent_table[agent_index].type = SCMI_AGENT_TYPE_OSPM;
        scmi_agent_table[agent_index].name = agent_cfg->name;

        for (j = 0; j < agent_cfg->channel_count; j++) {
            struct scpfw_channel_config *channel_cfg = agent_cfg->channel_config + j;
            struct mod_scmi_service_config *service_data;

            service_data = fwk_mm_calloc(1, sizeof(*service_data));

            scmi_service_elt[channel_index].name = channel_cfg->name;
            scmi_service_elt[channel_index].data = service_data;

            optee_mbx_elt[channel_index].name = channel_cfg->name;
            optee_mbx_elt[channel_index].data =
                (void *)(optee_mbx_data + channel_index);

            assert(agent_index < SCMI_AGENT_ID_COUNT);

            /* Make sure mailbox_idx stored in OPTEE is the same than SCP */
            assert(channel_index == channel_cfg->mailbox_idx);

            switch (module_idx_smt_table[agent_index])
            {
#if defined(CFG_SCPFW_MOD_MSG_SMT)
            case MAILBOX_TYPE_MSG_SMT:
               *service_data = (struct mod_scmi_service_config){
                    .transport_id = (fwk_id_t)
                        FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_MSG_SMT,
                                            msg_smt_index),
                    .transport_api_id = (fwk_id_t)
                        FWK_ID_API_INIT(FWK_MODULE_IDX_MSG_SMT,
                                        MOD_MSG_SMT_API_IDX_SCMI_TRANSPORT),
                    .scmi_agent_id = agent_cfg->agent_id,
                    .scmi_p2a_id = FWK_ID_NONE_INIT,
                };

                msg_smt_elt[msg_smt_index].name = channel_cfg->name;
                msg_smt_elt[msg_smt_index].data =
                    (void *)(msg_smt_data + msg_smt_index);

                msg_smt_data[msg_smt_index] =
                    (struct mod_msg_smt_channel_config){
                    .type = MOD_MSG_SMT_CHANNEL_TYPE_REQUESTER,
                    .mailbox_size = 128,
                    .driver_id = (fwk_id_t)
                        FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_MBX,
                                            channel_index),
                    .driver_api_id = (fwk_id_t)
                        FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_MBX, 0),
                };

                optee_mbx_data[channel_index] =
                    (struct mod_optee_mbx_channel_config){
                    .driver_id = (fwk_id_t)
                        FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_MSG_SMT,
                                            msg_smt_index),
                    .driver_api_id = (fwk_id_t)
                        FWK_ID_API_INIT(FWK_MODULE_IDX_MSG_SMT,
                                        MOD_MSG_SMT_API_IDX_DRIVER_INPUT),
                };
                msg_smt_index++;
                break;
#endif
#if defined(CFG_SCPFW_MOD_OPTEE_SMT)
            case MAILBOX_TYPE_OPTEE_SMT:
                *service_data = (struct mod_scmi_service_config){
                    .transport_id = (fwk_id_t)
                        FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_SMT,
                                            optee_smt_index),
                    .transport_api_id = (fwk_id_t)
                        FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_SMT,
                                        MOD_OPTEE_SMT_API_IDX_SCMI_TRANSPORT),
                    .scmi_agent_id = agent_cfg->agent_id,
                    .scmi_p2a_id = FWK_ID_NONE_INIT,
                };

                optee_smt_elt[optee_smt_index].name = channel_cfg->name;
                optee_smt_elt[optee_smt_index].data =
                    (void *)(optee_smt_data + optee_smt_index);

                assert(channel_cfg->shm.pa != 0);
                assert(channel_cfg->shm.size != 0);

                optee_smt_data[optee_smt_index] =
                    (struct mod_optee_smt_channel_config){
                    .type = MOD_OPTEE_SMT_CHANNEL_TYPE_REQUESTER,
                    .policies = MOD_SMT_POLICY_NONE,
                    .mailbox_address = channel_cfg->shm.pa,
                    .mailbox_size = 128,
                    .driver_id = (fwk_id_t)
                        FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_MBX,
                                            channel_index),
                    .driver_api_id = (fwk_id_t)
                        FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_MBX, 0),
                };

                optee_mbx_data[channel_index] =
                    (struct mod_optee_mbx_channel_config){
                    .driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_SMT,
                                                      optee_smt_index),
                    .driver_api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_SMT,
                            MOD_OPTEE_SMT_API_IDX_DRIVER_INPUT),
                };
                optee_smt_index++;
                break;
#endif
            default:
                panic("Incorrect SMT module_idx");
            }

            channel_index++;
        }
    }
};

